emacs/.emacs.d/settings.org
#+TITLE: settings.org

* Frame
** Transparency

   Function that simply changes the alpha of the current frame to =ALPHA=.

   #+BEGIN_SRC emacs-lisp
(defun set-frame-alpha (alpha)
  (set-frame-parameter (selected-frame) 'alpha (cons alpha alpha)))
   #+END_SRC

*** =set-alpha=

    Command to set the alpha value of the frame.

    #+BEGIN_SRC emacs-lisp
(defun set-alpha (alpha)
  "Change alpha of frame to ALPHA"
  (interactive "nNew alpha (0-100)")
  (set-frame-alpha alpha)
  (setq frame-alpha alpha)
  (setq transparent t))
    #+END_SRC

*** =toggle-transparency=

    Command to toggle transparency of the frame.

    #+BEGIN_SRC emacs-lisp
(defun toggle-transparency ()
  "Toggle transparency between 100 and frame-alpha (set by set-alpha)"
  (interactive)
  (set-frame-alpha (if transparent 100 frame-alpha))
  (setq transparent (not transparent)))
    #+END_SRC


    Bind =F12= to =toggle-transparency=.

    #+BEGIN_SRC emacs-lisp
(global-set-key [f12] #'toggle-transparency)
    #+END_SRC

*** Defaults

    Start emacs with alpha value 85.

    #+BEGIN_SRC emacs-lisp
(set-alpha 85)
    #+END_SRC

** Properties

   Disable the menu bar, tool bar, and scroll bar.

   #+BEGIN_SRC emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
   #+END_SRC


   Launch emacs maximized (fullscreen if on Windows).

   #+BEGIN_SRC emacs-lisp
(if (eq window-system 'w32)
    (toggle-frame-fullscreen)
  (add-to-list 'default-frame-alist '(fullscreen . maximized)))
   #+END_SRC

* Buffer
** Line and Column Indicators

   Show relative line numbers.

   #+BEGIN_SRC emacs-lisp
(global-display-line-numbers-mode 1)
(setq display-line-numbers-type 'relative)
   #+END_SRC


   Show ruler at column 80.

   #+BEGIN_SRC emacs-lisp
(global-display-fill-column-indicator-mode 1)
(setq-default fill-column 80)
   #+END_SRC


   Highlight line of cursor.

   #+BEGIN_SRC emacs-lisp
(global-hl-line-mode 1)
   #+END_SRC

** Editing
*** Block Guides

    Show indent and block guides as a character.

    #+BEGIN_SRC emacs-lisp
(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :config
  (setq-default highlight-indent-guides-method 'character))
    #+END_SRC

*** Delimiters
**** Rainbow Delimiters

     Show rainbow delimiters in =prog-mode=.

     #+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
     #+END_SRC

