emacs/.emacs.d/settings.org
**** Matching Brackets

     Highlight matching brackets when the cursor is on one of them.

     #+BEGIN_SRC emacs-lisp
(show-paren-mode 1)
     #+END_SRC


     Enable =electric-pair-mode=, automatically closing parentheses.

     #+BEGIN_SRC emacs-lisp
(electric-pair-mode 1)
     #+END_SRC

*** Autocomplete

    Enable autocomplete using =company=.

    #+BEGIN_SRC emacs-lisp
(use-package company
  :hook (after-init . global-company-mode))
    #+END_SRC

*** Code Cleanup on Save

    Reformat a file before saving by reindenting the buffer and removing
    trailing whitespace. This is rebound instead of it being a hook because if
    it's a hook, /any/ saved file becomes formatted, even ones which are
    generated and probably shouldn't be formatted according to Emacs.

    #+BEGIN_SRC emacs-lisp
(defun cleanup-and-save ()
  "Indents the buffer, removes trailing whitespace, and saves the it."
  (interactive)
  (indent-region (point-min) (point-max) nil)
  (delete-trailing-whitespace)
  (save-buffer))
(add-hook 'c-mode (lambda () (local-set-key (kbd "C-x C-s") #'cleanup-and-save)))
    #+END_SRC

*** =highlight-escape-sequences=

    Highlight escape sequences in string and character literals.

    #+BEGIN_SRC emacs-lisp
(use-package highlight-escape-sequences
  :config
  (hes-mode))
    #+END_SRC

** Properties
*** Font

    Set default font to be
    [[https://fonts.google.com/specimen/Source+Code+Pro][Source Code Pro]] 10 pt.

    #+BEGIN_SRC emacs-lisp
(set-frame-font "Source Code Pro-10" nil t)
    #+END_SRC

* Modes
** General
*** Indentation
**** Using Spaces

     Use spaces for the listed modes.

     #+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook (lambda () (setq indent-tabs-mode nil)))
     #+END_SRC

**** Tabs are 4 Spaces

     Make tabs display as 4 spaces wide instead of 8

     #+BEGIN_SRC emacs-lisp
(setq-default tab-width 4)
     #+END_SRC
     
**** Using Smart Tabs

     Enable smart tabs in the listed modes.

     #+BEGIN_SRC emacs-lisp
(use-package smart-tabs-mode
  :config
  (smart-tabs-insinuate 'c 'c++))
     #+END_SRC

** C

   Set indentation style to K&R with the exception of 4 space offset.

   #+BEGIN_SRC emacs-lisp
(setq c-default-style '((java-mode . "java")
                        (awk-mode . "awk")
                        (python-mode . "python")
                        (other . "k&r")))

(setq c-basic-offset 4)
   #+END_SRC

** Org

   Make code blocks handle tabs and spaces according to /their/ language mode,
   not org's.

   #+BEGIN_SRC emacs-lisp
(setq org-src-tab-acts-natively t)
   #+END_SRC


   Make code blocks not have the extra spaces in front of code in code blocks.

   #+BEGIN_SRC emacs-lisp
(setq org-src-preserve-indentation t)
   #+END_SRC


   Turn on =auto-fill-mode= when using org.

   #+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook #'auto-fill-mode)
   #+END_SRC


   When exporting org to HTML, use =htmlize= to enable syntax highlighting of
   code blocks.

   #+BEGIN_SRC emacs-lisp
(use-package htmlize)
   #+END_SRC

* Windows
** =ace-window=

   Enable =ace-window=.

   #+BEGIN_SRC emacs-lisp
(use-package ace-window
  :bind ("M-o" . ace-window))
   #+END_SRC

* Workflow
