emacs/.emacs.d/settings.html

<li><a id="org785a1b3"></a>Matching Brackets<br />
<div class="outline-text-5" id="text-2-2-2-2">
<p>
Highlight matching brackets when the cursor is on one of them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>show-paren-mode 1<span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
Enable <code>electric-pair-mode</code>, automatically closing parentheses.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>electric-pair-mode 1<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org683ca1c" class="outline-4">
<h4 id="org683ca1c"><span class="section-number-4">2.2.3</span> Autocomplete</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Enable autocomplete using <code>company</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">company</span>
  <span style="color: #839496; font-weight: bold;">:hook</span> <span style="color: #b58900;">(</span>after-init . global-company-mode<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ac2a48" class="outline-4">
<h4 id="org6ac2a48"><span class="section-number-4">2.2.4</span> Code Cleanup on Save</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Reformat a file before saving by reindenting the buffer and removing
trailing whitespace. This is rebound instead of it being a hook because if
it's a hook, <i>any</i> saved file becomes formatted, even ones which are
generated and probably shouldn't be formatted according to Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">cleanup-and-save</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198;">"Indents the buffer, removes trailing whitespace, and saves the it."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>indent-region <span style="color: #268bd2;">(</span>point-min<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>point-max<span style="color: #268bd2;">)</span> nil<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>delete-trailing-whitespace<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>save-buffer<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-x C-s"</span><span style="color: #b58900;">)</span> #'cleanup-and-save<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b7445a" class="outline-4">
<h4 id="org1b7445a"><span class="section-number-4">2.2.5</span> <code>highlight-escape-sequences</code></h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Highlight escape sequences in string and character literals.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">highlight-escape-sequences</span>
  <span style="color: #839496; font-weight: bold;">:config</span>
  <span style="color: #b58900;">(</span>hes-mode<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org66a6f0c" class="outline-3">
<h3 id="org66a6f0c"><span class="section-number-3">2.3</span> Properties</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgbd57cb4" class="outline-4">
<h4 id="orgbd57cb4"><span class="section-number-4">2.3.1</span> Font</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Set default font to be
<a href="https://fonts.google.com/specimen/Source+Code+Pro">Source Code Pro</a> 10 pt.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>set-frame-font <span style="color: #2aa198;">"Source Code Pro-10"</span> nil t<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org5507738" class="outline-2">
<h2 id="org5507738"><span class="section-number-2">3</span> Modes</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga5f3a45" class="outline-3">
<h3 id="orga5f3a45"><span class="section-number-3">3.1</span> General</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgd783d8c" class="outline-4">
<h4 id="orgd783d8c"><span class="section-number-4">3.1.1</span> Indentation</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="orga4e3a94"></a>Using Spaces<br />
<div class="outline-text-5" id="text-3-1-1-1">
<p>
Use spaces for the listed modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>add-hook 'emacs-lisp-mode-hook <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">()</span> <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">setq</span> indent-tabs-mode nil<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org81abb08"></a>Using Smart Tabs<br />
<div class="outline-text-5" id="text-3-1-1-2">
<p>
Enable smart tabs in the listed modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">smart-tabs-mode</span>
  <span style="color: #839496; font-weight: bold;">:config</span>
  <span style="color: #b58900;">(</span>smart-tabs-insinuate 'c 'c++<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org437ee3d" class="outline-3">
<h3 id="org437ee3d"><span class="section-number-3">3.2</span> Org</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Make code blocks handle tabs and spaces according to <i>their</i> language mode,
not org's.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> org-src-tab-acts-natively t<span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
Make code blocks not have the extra spaces in front of code in code blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> org-src-preserve-indentation t<span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
Turn on <code>auto-fill-mode</code> when using org.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>add-hook 'org-mode-hook #'auto-fill-mode<span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
When exporting org to HTML, use <code>htmlize</code> to enable syntax highlighting of
code blocks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">htmlize</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org559eefa" class="outline-2">
<h2 id="org559eefa"><span class="section-number-2">4</span> Windows</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5f0eb48" class="outline-3">
<h3 id="org5f0eb48"><span class="section-number-3">4.1</span> <code>ace-window</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
Enable <code>ace-window</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">ace-window</span>
  <span style="color: #839496; font-weight: bold;">:bind</span> <span style="color: #b58900;">(</span><span style="color: #2aa198;">"M-o"</span> . ace-window<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
