emacs/.emacs.d/settings.org
** =eshell-window=

   Command used to create, delete, and select =eshell= windows.

   #+BEGIN_SRC emacs-lisp
(defun eshell-window ()
  "Deletes selected window if it is has an eshell buffer open. If selected
window does not have an eshell buffer open, selects a window with an open eshell
buffer. If no window has an eshell buffer, create one across the bottom."
  (interactive)
  (if (string= (buffer-name) "*eshell*")
      (delete-window)
    (select-window (or (get-buffer-window "*eshell*")
                       (split-window (frame-root-window) -15 'below)))
    (unless (string= (buffer-name) "*eshell*")
      (eshell))))
   #+END_SRC


   Bind =F7= to =eshell-window=.

   #+BEGIN_SRC emacs-lisp
(global-set-key [f7] #'eshell-window)
   #+END_SRC

** =projectile=

   Use =projectile= for project management.

   #+BEGIN_SRC emacs-lisp
(use-package projectile
  :hook (after-init . projectile-mode)
  :bind-keymap
  ("C-c p" . projectile-command-map))
   #+END_SRC

** =neotree=

   Enable =neotree=, set =neo-theme= to =ascii=, and bind =F8= to
   =neotree-toggle=.

   #+BEGIN_SRC emacs-lisp
(use-package neotree
  :bind ([f8] . neotree-toggle)
  :init
  (setq-default neo-theme 'ascii))
   #+END_SRC

** =magit=

   Enable =magit=.

   #+BEGIN_SRC emacs-lisp
(use-package magit)
   #+END_SRC

* Misc
** Backups

   Move backup files to =~/.gen/emacs/backups= and change some settings to make
   backups generally better.

   #+BEGIN_SRC emacs-lisp
(setq backup-directory-alist '(("." . "~/.gen/emacs/backups"))
      version-control t
      delete-old-versions t)
   #+END_SRC

** Theme

   Use =solarized-dark= theme. In org mode, use monospace, non-scaled headlines.

   #+BEGIN_SRC emacs-lisp
(use-package solarized-theme
  :init
  (setq solarized-use-variable-pitch nil
        solarized-scale-org-headlines nil)
  :config
  (load-theme 'solarized-dark t))
   #+END_SRC

** Minibuffer
*** Y/N Prompt

    Change yes/no prompts to y/n.

    #+BEGIN_SRC emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
    #+END_SRC

*** Autocomplete

    Enable minibuffer autocomplete using =ivy=.

    #+BEGIN_SRC emacs-lisp
(use-package ivy
  :config
  (ivy-mode 1))
    #+END_SRC

