emacs/.emacs.d/settings.html

<div id="outline-container-org1d8a429" class="outline-2">
<h2 id="org1d8a429"><span class="section-number-2">5</span> Workflow</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc286f43" class="outline-3">
<h3 id="orgc286f43"><span class="section-number-3">5.1</span> <code>eshell-window</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
Command used to create, delete, and select <code>eshell</code> windows.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">eshell-window</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198;">"Deletes selected window if it is has an eshell buffer open. If selected</span>
<span style="color: #2aa198;">window does not have an eshell buffer open, selects a window with an open eshell</span>
<span style="color: #2aa198;">buffer. If no window has an eshell buffer, create one across the bottom."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">interactive</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>string= <span style="color: #6c71c4;">(</span>buffer-name<span style="color: #6c71c4;">)</span> <span style="color: #2aa198;">"*eshell*"</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>delete-window<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>select-window <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">or</span> <span style="color: #859900;">(</span>get-buffer-window <span style="color: #2aa198;">"*eshell*"</span><span style="color: #859900;">)</span>
                       <span style="color: #859900;">(</span>split-window <span style="color: #b58900;">(</span>frame-root-window<span style="color: #b58900;">)</span> -15 'below<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">unless</span> <span style="color: #6c71c4;">(</span>string= <span style="color: #859900;">(</span>buffer-name<span style="color: #859900;">)</span> <span style="color: #2aa198;">"*eshell*"</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>eshell<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
Bind <code>F7</code> to <code>eshell-window</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>global-set-key <span style="color: #b58900;">[</span>f7<span style="color: #b58900;">]</span> #'eshell-window<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd38b889" class="outline-3">
<h3 id="orgd38b889"><span class="section-number-3">5.2</span> <code>projectile</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Use <code>projectile</code> for project management.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">projectile</span>
  <span style="color: #839496; font-weight: bold;">:hook</span> <span style="color: #b58900;">(</span>after-init . projectile-mode<span style="color: #b58900;">)</span>
  <span style="color: #839496; font-weight: bold;">:bind-keymap</span>
  <span style="color: #b58900;">(</span><span style="color: #2aa198;">"C-c p"</span> . projectile-command-map<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73db25c" class="outline-3">
<h3 id="org73db25c"><span class="section-number-3">5.3</span> <code>neotree</code></h3>
<div class="outline-text-3" id="text-5-3">
<p>
Enable <code>neotree</code>, set <code>neo-theme</code> to <code>ascii</code>, and bind <code>F8</code> to
<code>neotree-toggle</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">neotree</span>
  <span style="color: #839496; font-weight: bold;">:bind</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>f8<span style="color: #268bd2;">]</span> . neotree-toggle<span style="color: #b58900;">)</span>
  <span style="color: #839496; font-weight: bold;">:init</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">setq-default</span> neo-theme 'ascii<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org24d85c5" class="outline-3">
<h3 id="org24d85c5"><span class="section-number-3">5.4</span> <code>magit</code></h3>
<div class="outline-text-3" id="text-5-4">
<p>
Enable <code>magit</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">magit</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge5c1909" class="outline-2">
<h2 id="orge5c1909"><span class="section-number-2">6</span> Misc</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org3ffd48c" class="outline-3">
<h3 id="org3ffd48c"><span class="section-number-3">6.1</span> Backups</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Move backup files to <code>~/.emacs.d/.backups</code> and change some settings to make
backups generally better.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq</span> backup-directory-alist '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span><span style="color: #2aa198;">"."</span> . <span style="color: #2aa198;">"~/.emacs.d/.backups"</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
      version-control t
      delete-old-versions t<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e1e16e" class="outline-3">
<h3 id="org7e1e16e"><span class="section-number-3">6.2</span> Theme</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Use <code>solarized-dark</code> theme. In org mode, use monospace, non-scaled headlines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">solarized-theme</span>
  <span style="color: #839496; font-weight: bold;">:init</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">setq</span> solarized-use-variable-pitch nil
        solarized-scale-org-headlines nil<span style="color: #b58900;">)</span>
  <span style="color: #839496; font-weight: bold;">:config</span>
  <span style="color: #b58900;">(</span>load-theme 'solarized-dark t<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4acc0e" class="outline-3">
<h3 id="orga4acc0e"><span class="section-number-3">6.3</span> Minibuffer</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org661a8cd" class="outline-4">
<h4 id="org661a8cd"><span class="section-number-4">6.3.1</span> Y/N Prompt</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
Change yes/no prompts to y/n.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defalias</span> '<span style="color: #268bd2;">yes-or-no-p</span> 'y-or-n-p<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a46c46" class="outline-4">
<h4 id="org0a46c46"><span class="section-number-4">6.3.2</span> Autocomplete</h4>
<div class="outline-text-4" id="text-6-3-2">
<p>
Enable minibuffer autocomplete using <code>ivy</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">use-package</span> <span style="color: #268bd2; font-weight: bold;">ivy</span>
  <span style="color: #839496; font-weight: bold;">:config</span>
  <span style="color: #b58900;">(</span>ivy-mode 1<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
