emacs/.emacs.d/settings.org
** Mode Line

   Functions to format the mode line.

   #+BEGIN_SRC emacs-lisp
(defun align-mode-line (left right)
  "Return a string with text aligned LEFT and RIGHT for the mode line"
  (let* ((true-left (format-mode-line left))
         (true-right (format-mode-line right))
         (available-width
          (- (window-total-width) (length true-left))))
    (replace-regexp-in-string
     "%" "%%"
     (format (format "%%s%%%ds" available-width) true-left true-right))))
   #+END_SRC


   Set =mode-line-format=. Format is the following:
   - Left aligned
     1. Memory warning if there is one
     2. Buffer name
     3. A character depending on the state of the buffer
        + '%' if the buffer is read only
        + '*' if the buffer is modified
        + '-' otherwise
     4. The name of the major mode wrapped in square brackets
   - Right aligned
     1. The line of the cursor, a colon, and the column of the cursor
     2. Percentage of buffer text above the top of the window
     3. The size of the file
     4. Source control

   #+BEGIN_SRC emacs-lisp
(setq-default mode-line-format
              '((:eval (align-mode-line
                        '("%e "
                          mode-line-buffer-identification " "
                          mode-line-modified " "
                          "[" mode-name "]")
                        '("%l:%c "
                          mode-line-percent-position " of %IB"
                          vc-mode
                          " ")))))
   #+END_SRC


   Remove the underline from the mode line.

   #+BEGIN_SRC emacs-lisp
(set-face-attribute 'mode-line nil
                    :underline nil)

(set-face-attribute 'mode-line-inactive nil
                    :underline nil)
   #+END_SRC

* TODO Future [4/7]
  - [ ] prettify :: kind of like ligatures
  - [X] electric-pair :: matching parens auto-inserted
  - [X] magit :: git interface
  - [ ] beacon :: cursor tracking
  - [X] ivy :: minibuffer autocomplete
  - [X] projectile :: project management
  - [ ] desktop :: saving emacs sessions
  - [ ] irony-mode :: suppliment to company
