emacs/.emacs.d/settings.html

<div id="outline-container-orgde69c1f" class="outline-3">
<h3 id="orgde69c1f"><span class="section-number-3">6.4</span> Mode Line</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Functions to format the mode line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">align-mode-line</span> <span style="color: #b58900;">(</span>left right<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"Return a string with text aligned LEFT and RIGHT for the mode line"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>true-left <span style="color: #859900;">(</span>format-mode-line left<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>true-right <span style="color: #859900;">(</span>format-mode-line right<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>available-width
          <span style="color: #859900;">(</span>- <span style="color: #b58900;">(</span>window-total-width<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>length true-left<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>replace-regexp-in-string
     <span style="color: #2aa198;">"%"</span> <span style="color: #2aa198;">"%%"</span>
     <span style="color: #6c71c4;">(</span>format <span style="color: #859900;">(</span>format <span style="color: #2aa198;">"%%s%%%ds"</span> available-width<span style="color: #859900;">)</span> true-left true-right<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
Set <code>mode-line-format</code>. Format is the following:
</p>
<ul class="org-ul">
<li>Left aligned
<ol class="org-ol">
<li>Memory warning if there is one</li>
<li>Buffer name</li>
<li>A character depending on the state of the buffer
<ul class="org-ul">
<li>'%' if the buffer is read only</li>
<li>'*' if the buffer is modified</li>
<li>'-' otherwise</li>
</ul></li>
<li>The name of the major mode wrapped in square brackets</li>
</ol></li>
<li>Right aligned
<ol class="org-ol">
<li>The line of the cursor, a colon, and the column of the cursor</li>
<li>Percentage of buffer text above the top of the window</li>
<li>The size of the file</li>
<li>Source control</li>
</ol></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">setq-default</span> mode-line-format
              '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span><span style="color: #839496; font-weight: bold;">:eval</span> <span style="color: #6c71c4;">(</span>align-mode-line
                        '<span style="color: #859900;">(</span><span style="color: #2aa198;">"%e "</span>
                          mode-line-buffer-identification <span style="color: #2aa198;">" "</span>
                          mode-line-modified <span style="color: #2aa198;">" "</span>
                          <span style="color: #2aa198;">"["</span> mode-name <span style="color: #2aa198;">"]"</span><span style="color: #859900;">)</span>
                        '<span style="color: #859900;">(</span><span style="color: #2aa198;">"%l:%c "</span>
                          mode-line-percent-position <span style="color: #2aa198;">" of %IB"</span>
                          vc-mode
                          <span style="color: #2aa198;">" "</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>


<p>
Remove the underline from the mode line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa198;">(</span>set-face-attribute 'mode-line nil
                    <span style="color: #839496; font-weight: bold;">:underline</span> nil<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>set-face-attribute 'mode-line-inactive nil
                    <span style="color: #839496; font-weight: bold;">:underline</span> nil<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbb2b569" class="outline-2">
<h2 id="orgbb2b569"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Future <code>[4/7]</code></h2>
<div class="outline-text-2" id="text-7">
<dl class="org-dl">
<dt class="off"><code>[&#xa0;]</code> prettify</dt><dd>kind of like ligatures</dd>
<dt class="on"><code>[X]</code> electric-pair</dt><dd>matching parens auto-inserted</dd>
<dt class="on"><code>[X]</code> magit</dt><dd>git interface</dd>
<dt class="off"><code>[&#xa0;]</code> beacon</dt><dd>cursor tracking</dd>
<dt class="on"><code>[X]</code> ivy</dt><dd>minibuffer autocomplete</dd>
<dt class="on"><code>[X]</code> projectile</dt><dd>project management</dd>
<dt class="off"><code>[&#xa0;]</code> desktop</dt><dd>saving emacs sessions</dd>
<dt class="off"><code>[&#xa0;]</code> irony-mode</dt><dd>suppliment to company</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-01-17 Sun 22:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
